# ===============================
#  إعدادات بوت جمهورية السادس
# ===============================

BOT_TOKEN = "8782658031:AAEU148xczlpmNcprUoDB_iu4jfaaFSpqz8"

# يوزرنيم القناة بدون @
CHANNEL_USERNAME = "ovsn772"

# آيدي الأدمنات (أضف آيديك هنا)
ADMIN_IDS = [8782658031]

# اسم البوت
BOT_NAME = "بوت جمهورية السادس"

# وصف البوت
BOT_DESCRIPTION = "بوتك التعليمي المخصص لطلاب السادس الإعدادي 📚"

# مسار قاعدة البيانات
DB_PATH = "data/bot.db"

# بروكسي (اتركه فارغاً إذا ما تحتاجه)
# مثال: "http://127.0.0.1:7890" أو "socks5://127.0.0.1:1080"
PROXY_URL = ""
